#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int printCube(char cb[]){
    printf("\n");
    printf("\t         %c  %c  %c\n",cb[32],cb[33],cb[34]);
    printf("\t         %c  W  %c\n",cb[39],cb[35]);
    printf("\t         %c  %c  %c\n",cb[38],cb[37],cb[36]);
    printf("\t%c  %c  %c  %c  %c  %c  %c  %c  %c  %c  %c  %c\n",
    cb[24],cb[25],cb[26],cb[0],cb[1],cb[2],cb[8],cb[9],cb[10],cb[16],cb[17],cb[18]);
    printf("\t%c  B  %c  %c  G  %c  %c  R  %c  %c  N  %c\n", 
    cb[31],cb[27],cb[7],cb[3],cb[15],cb[11],cb[23],cb[19]);
    printf("\t%c  %c  %c  %c  %c  %c  %c  %c  %c  %c  %c  %c\n", 
    cb[30],cb[29],cb[28],cb[6],cb[5],cb[4],cb[14],cb[13],cb[12],cb[22],cb[21],cb[20]);
    printf("\t         %c  %c  %c\n",cb[40],cb[41],cb[42]);
    printf("\t         %c  Y  %c\n",cb[47],cb[43]);
    printf("\t         %c  %c  %c\n\n",cb[46],cb[45],cb[44]);
    printf("どの面を回しますか。(b,g,r,n,w,y)・終了はe:");
}
void main(){
    system("chcp 65001\n"); 
    printf("\n\t  ★  キューブの初期状態 ★\n");    
    char cube[48]="GGGGGGGGRRRRRRRRNNNNNNNNBBBBBBBBWWWWWWWWYYYYYYYY";
    printCube(cube);    
    char s[48], col[1];
    int kai_r[48]={0,1,42,43,44,5,6,7,14,15,8,9,10,11,12,13,36,17,18,19,20,21,34,35,24,25,26,27,28,29,30,31,32,33,2,3,4,37,38,39,40,41,22,23,16,45,46,47};
    int kai_g[48]={6,7,0,1,2,3,4,5,38,9,10,11,12,13,36,37,16,17,18,19,20,21,22,23,24,25,40,41,42,29,30,31,32,33,34,35,26,27,28,39,14,15,8,43,44,45,46,47};
    int kai_n[48]={0,1,2,3,4,5,6,7,8,9,44,45,46,13,14,15,22,23,16,17,18,19,20,21,34,25,26,27,28,29,32,33,10,11,12,35,36,37,38,39,40,41,42,43,30,31,24,47};
    int kai_w[48]={8,9,10,3,4,5,6,7,16,17,18,11,12,13,14,15,24,25,26,19,20,21,22,23,0,1,2,27,28,29,30,31,38,39,32,33,34,35,36,37,40,41,42,43,44,45,46,47};
    int kai_y[48]={0,1,2,3,28,29,30,7,8,9,10,11,4,5,6,15,16,17,18,19,12,13,14,23,24,25,26,27,20,21,22,31,32,33,34,35,36,37,38,39,46,47,40,41,42,43,44,45};
    int kai_b[48]={32,1,2,3,4,5,38,39,8,9,10,11,12,13,14,15,16,17,46,47,40,21,22,23,30,31,24,25,26,27,28,29,20,33,34,35,36,37,18,19,0,41,42,43,44,45,6,7};
    scanf("%s",&col[0]);   
    while (col[0] !='e'){    
        for (int  i=0; i<48; i++){
            if(col[0] == 'r' ) s[i]=cube[kai_r[i]];
            if(col[0] == 'b' ) s[i]=cube[kai_b[i]];
            if(col[0] == 'g' ) s[i]=cube[kai_g[i]];
            if(col[0] == 'n' ) s[i]=cube[kai_n[i]];
            if(col[0] == 'w' ) s[i]=cube[kai_w[i]];
            if(col[0] == 'y' ) s[i]=cube[kai_y[i]];
        }
        for(int j=0; j<48;  j++){
            cube[j]=s[j];
        }        
        printCube(cube);        
        scanf("%s",&col[0]);                 
    }    
}

